# MaximumGridWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..MaximumGridWidth Property
TableView Class See Also
---
Gets the allowed maximum grid width
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int MaximumGridWidth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaximumGridWidth As Integer
	Get
```

Visual C++
---
```text
public:
property int MaximumGridWidth {
	int get ();
}
```

# See Also
TableView Class
Autodesk.Revit.DB Namespace